_posts/2013-10-22-Sharing-data-via-JSON-files.html
---
title: Sharing data via JSON files
date: 2013/10/22 14:39:56
updated: 2013/10/22 14:39:56
categories: dft,ase
tags: 
---


<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. Summary</a></li>
</ul>
</div>
</div>
<p>
In a previous <a href="http://jkitchin.github.io/blog/2013/10/19/Serializing-jasp-calculations-as-json-data/">post</a> I discussed how to represent a single DFT calculation in a JSON file that could easily be shared, and reanalyzed. Here I look at sharing a series of calculations. I had previously run calculations to analyze an equation of state for Cu. Here we create a list of the JSON representations of each calculation, and save it in one overall JSON file. We will give the data some structure and documentation. JSON represents dictionaries very well, so we build a dictionary of the results and then "dump" that dictionary to a JSON file.
</p>


<div class="org-src-container">

<pre class="src src-python"><span style="color: #8b0000;">from</span> jasp <span style="color: #8b0000;">import</span> *

<span style="color: #8b008b;">LC</span> = [3.5, 3.55, 3.6, 3.65, 3.7, 3.75]

<span style="color: #8b008b;">data</span> = {<span style="color: #228b22;">'doc'</span>:<span style="color: #228b22;">'JSON file containing a set of calculations for the equation of state of Cu'</span>}

<span style="color: #8b008b;">data</span>[<span style="color: #228b22;">'calculations'</span>] = []

<span style="color: #8b0000;">for</span> a <span style="color: #8b0000;">in</span> LC:
    <span style="color: #8b0000;">with</span> jasp(<span style="color: #228b22;">'../bulk/Cu-{0}'</span>.<span style="color: #cd0000;">format</span>(a)) <span style="color: #8b0000;">as</span> calc:
        data[<span style="color: #228b22;">'calculations'</span>].append(calc.<span style="color: #cd0000;">dict</span>)

<span style="color: #8b0000;">import</span> json
<span style="color: #8b0000;">with</span> <span style="color: #cd0000;">open</span>(<span style="color: #228b22;">'eos.json'</span>, <span style="color: #228b22;">'wb'</span>) <span style="color: #8b0000;">as</span> f:
    f.write(json.dumps(data))
</pre>
</div>

<p>
Now, you can view this <a href="/media/2013-10-22-Sharing-data-via-JSON-files/eos.json">eos.json</a> file, and analyze it yourself as follows. In python we read the file in and convert it to a data structure using the <code>json</code> module.
</p>

<div class="org-src-container">

<pre class="src src-python"><span style="color: #8b0000;">import</span> json

<span style="color: #8b0000;">with</span> <span style="color: #cd0000;">open</span>(<span style="color: #228b22;">'eos.json'</span>, <span style="color: #228b22;">'rb'</span>) <span style="color: #8b0000;">as</span> f:
    <span style="color: #8b008b;">d</span> = json.loads(f.read())

<span style="color: #8b008b;">volumes</span> =  [entry[<span style="color: #228b22;">'data'</span>][<span style="color: #228b22;">'volume'</span>] <span style="color: #8b0000;">for</span> entry <span style="color: #8b0000;">in</span> d[<span style="color: #228b22;">'calculations'</span>]]
<span style="color: #8b008b;">energies</span> = [entry[<span style="color: #228b22;">'data'</span>][<span style="color: #228b22;">'total_energy'</span>] <span style="color: #8b0000;">for</span> entry <span style="color: #8b0000;">in</span> d[<span style="color: #228b22;">'calculations'</span>]]

<span style="color: #8b0000;">import</span> matplotlib.pyplot <span style="color: #8b0000;">as</span> plt
plt.plot(volumes, energies)
plt.xlabel(<span style="color: #228b22;">'Volume ($\AA$)'</span>)
plt.ylabel(<span style="color: #228b22;">'Total energy (eV)'</span>)
plt.savefig(<span style="color: #228b22;">'eos-from-json.png'</span>)
plt.show()
</pre>
</div>

<p>
If you wanted to do further analysis you could. Suppose you wanted to know more detail about how that calculation was done? You can retrieve the INCAR, KPOINT, and POTCAR details for each calculation. Any parameter not listed here was not specified in the calculations.
</p>

<div class="org-src-container">

<pre class="src src-python"><span style="color: #8b0000;">import</span> json

<span style="color: #8b0000;">with</span> <span style="color: #cd0000;">open</span>(<span style="color: #228b22;">'eos.json'</span>, <span style="color: #228b22;">'rb'</span>) <span style="color: #8b0000;">as</span> f:
    <span style="color: #8b008b;">d</span> = json.loads(f.read())

<span style="color: #ff0000; font-weight: bold;"># </span><span style="color: #ff0000; font-weight: bold;">print details for the first calculation in the list</span>
<span style="color: #8b0000;">print</span> d[<span style="color: #228b22;">'calculations'</span>][0][<span style="color: #228b22;">'incar'</span>]
<span style="color: #8b0000;">print</span> d[<span style="color: #228b22;">'calculations'</span>][0][<span style="color: #228b22;">'input'</span>]
<span style="color: #8b0000;">print</span> d[<span style="color: #228b22;">'calculations'</span>][0][<span style="color: #228b22;">'potcar'</span>]
</pre>
</div>

<pre class="example">
{u'doc': u'INCAR parameters', u'nbands': 9, u'encut': 350.0, u'prec': u'Normal'}
{u'kpts': [8, 8, 8], u'reciprocal': False, u'xc': u'PBE', u'kpts_nintersections': None, u'setups': None, u'txt': u'-', u'gamma': False}
[[u'Cu', u'potpaw_PBE/Cu/POTCAR', u'a44c591415026f53deb16a99ca3f06b1e69be10b']]
</pre>

<p>
The POTCAR information contains the species, the path to the POTCAR, and a git-hash of the POTCAR file. That way you can tell if you used exactly the same file that I did. You can compute a git hash like <a href="http://git-scm.com/book/en/Git-Internals-Git-Objects#Object-Storage">this</a> :
</p>

<div class="org-src-container">

<pre class="src src-sh">cat /home-research/jkitchin/src/vasp/potpaw_PBE/Cu/POTCAR | git hash-object --stdin
</pre>
</div>

<pre class="example">
a44c591415026f53deb16a99ca3f06b1e69be10b
</pre>

<p>
If you want to get the details of the geometry of some calculation, you do it this way:
</p>

<div class="org-src-container">

<pre class="src src-python"><span style="color: #8b0000;">import</span> json

<span style="color: #8b0000;">with</span> <span style="color: #cd0000;">open</span>(<span style="color: #228b22;">'eos.json'</span>, <span style="color: #228b22;">'rb'</span>) <span style="color: #8b0000;">as</span> f:
    <span style="color: #8b008b;">d</span> = json.loads(f.read())

<span style="color: #8b0000;">print</span> d[<span style="color: #228b22;">'calculations'</span>][0][<span style="color: #228b22;">'atoms'</span>].keys()
<span style="color: #8b0000;">print</span> <span style="color: #228b22;">'cell = '</span>, d[<span style="color: #228b22;">'calculations'</span>][0][<span style="color: #228b22;">'atoms'</span>][<span style="color: #228b22;">'cell'</span>]
<span style="color: #8b0000;">print</span> <span style="color: #228b22;">'syms = '</span>, d[<span style="color: #228b22;">'calculations'</span>][0][<span style="color: #228b22;">'atoms'</span>][<span style="color: #228b22;">'symbols'</span>]
<span style="color: #8b0000;">print</span> <span style="color: #228b22;">'cpos = '</span>, d[<span style="color: #228b22;">'calculations'</span>][0][<span style="color: #228b22;">'atoms'</span>][<span style="color: #228b22;">'positions'</span>]
</pre>
</div>

<pre class="example">
[u'cell', u'symbols', u'positions', u'pbc', u'tags']
cell =  [[1.75, 1.75, 0.0], [0.0, 1.75, 1.75], [1.75, 0.0, 1.75]]
syms =  [u'Cu']
cpos =  [[0.0, 0.0, 0.0]]
</pre>

<p>
You can do further analysis from there.
</p>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Summary</h2>
<div class="outline-text-2" id="text-1">
<p>
This looks ok as a data sharing mechanism. The json file here is pretty small (6.8 kb), and pretty easy to work with. Clearly some thought must go into how the data is structured so you know what to get, and how you get it. That could even be documented in the json file itself. For instance, each calculator has a doc element that describes what is in it. The json file we made above also has that data. 
</p>
<div class="org-src-container">

<pre class="src src-python"><span style="color: #8b0000;">import</span> json

<span style="color: #8b0000;">with</span> <span style="color: #cd0000;">open</span>(<span style="color: #228b22;">'eos.json'</span>, <span style="color: #228b22;">'rb'</span>) <span style="color: #8b0000;">as</span> f:
    <span style="color: #8b008b;">d</span> = json.loads(f.read())

<span style="color: #8b0000;">print</span> d[<span style="color: #228b22;">'doc'</span>]
<span style="color: #8b0000;">print</span>
<span style="color: #8b0000;">print</span> d[<span style="color: #228b22;">'calculations'</span>][0][<span style="color: #228b22;">'doc'</span>]
</pre>
</div>

<pre class="example">
JSON file containing a set of calculations for the equation of state of Cu

JSON representation of a VASP calculation.

energy is in eV
forces are in eV/\AA
stress is in GPa (sxx, syy, szz,  syz, sxz, sxy)
magnetic moments are in Bohr-magneton
The density of states is reported with E_f at 0 eV.
Volume is reported in \AA^3
Coordinates and cell parameters are reported in \AA

If atom-projected dos are included they are in the form:
{ados:{energy:data, {atom index: {orbital : dos}}}
</pre>

<p>
For archival purposes you may want to put a creation date, contact data, etc&#x2026; in the file too.
</p>
</div>
</div>
<p>Copyright (C) 2013 by John Kitchin. See the <a href="/copying.html">License</a> for information about copying.<p><p><a href="/org/2013/10/22/Sharing-data-via-JSON-files.org">org-mode source</a><p>